{
  "0_TextBox_0": "AI-based Segmentation in 3D Slicer",
  "0_TextBox_1": "Sonia Pujol, Ph. D\nBrigham and Women's Hospital,\nHarvard Medical School\nBoston, MA",
  "0_TextBox_3": "Slicer Ribeirão Preto Workshop\nJune 30, 2025",
  "1_TextBox_0": "Manual vs AI-powered Segmentation",
  "2_TextBox_0": "Manual vs AI-powered Segmentation",
  "1_TextBox_1": "Medical images have traditionally been manually segmented, which is a time-consuming process that requires intensive effort by radiologists and is subject to inter-reader variability.",
  "2_TextBox_1": "In the past decade, image segmentation has been powered by the development of deep learning algorithms (e.g. nnUnet by the German Cancer Research Center (DKFZ)/Helmholtz Research).\n\n\nAI-powered segmentation tools can reduce the segmentation time and provide more reproducible results.",
  "3_TextBox_0": "AI Terminology",
  "3_TextBox_1": "A is an AI algorithm that was trained to perform a specific task (e.g. brain tumor segmentation model).\n\nThe Weights of an AI model are small numbers that determine how  much importance the model gives to different image features.\n\nDuring the Training phase, a Model learns patterns from data labelled  by experts and adjusts its weights to improve its predictions.\n\nDuring the Validation/Test phase, the model is evaluated on a separate set of data not used during the Training phase.\n\nDuring Inference, the model is applied to new datasets to perform the specific task it was trained for.",
  "4_TextBox_0": "3D Slicer AI Workshop",
  "4_TextBox_1": "This tutorial focuses on running inference tasks using various pretrained AI models for automated segmentation of anatomical and pathological structures.",
  "5_TextBox_0": "MONAIAuto3DSeg Slicer extension",
  "6_TextBox_0": "MONAIAuto3DSeg Slicer extension",
  "5_TextBox_1": "This tutorial uses the pre-trained models of the MONAIAuto3DSeg Slicer extension.\n\n\nThe tool is designed to work on laptops or on average desktop computer without a GPU.",
  "6_TextBox_1": "Multiple modalities Support (CT, MRI).\n\n\nMultiple anatomies (head, thorax, abdomen, pelvis, etc.).\n\n\nMultiple pathologies (tumor, hemorrhage, edema).",
  "7_TextBox_0": "Slicer AI Tutorial: Segmentation Tasks",
  "7_TextBox_1": "Segmentation Task #1: Prostate.\n\n\nSegmentation Task #2: Brain Glioma.\n\n\nSegmentation Task #3: Whole Body Segmentation.",
  "8_TextBox_0": "AI Segmentation Task #1: Prostate",
  "9_TextBox_1": "AI-based Segmentation of Peripheral Zone (PZ) and Transition Zone (TZ) of the prostate on T2-weighted MRI Images.\n\n\nDataset:\nmsd_prostate_01-t2\nmsd_prostate_01-adc",
  "10_TextBox_1": "Click on Add Data in the Welcome to Slicer Module\n\nClick on Choose Directory to Add and browse to the location of the Slicer datasets",
  "11_TextBox_0": "Slicer loads the prostate MRI data set",
  "12_TextBox_0": "Click on Welcome to Slicer in the Modules' menu and browse to the category Segmentation\n\nSelec the MONAI Auto3DSeg module",
  "13_TextBox_0": "Enter the model's name Prostate in the Segmentation model menu",
  "13_TextBox_1": "Select the model Prostate - Multisequence",
  "14_TextBox_0": "Enter the Input T2 volume msd-prostate-01-adc and the Input ADC volume msd-prostate-01-adc.",
  "14_TextBox_1": "Click on Create new segmentation on Apply",
  "16_TextBox_0": "Slicer shows the results of the AI-based prostate segmentation",
  "17_TextBox_0": "AI Segmentation Task #2: Brain Glioma",
  "18_TextBox_1": "AI-based Segmentation of Neoplasm, Necrosis and Edema in Brain MRI images.\n\n\nDatasets:\n1) BraTS-GLI_00005-000-t1n (T1-weighted)\n2) BraTS-GLI_00005-000-t1c (T1-weighted post-Gd)\n3) BraTS-GLI_00005-000-t2w (T2-weighted)\n4) BraTS-GLI_00005-000-t2f (T2-FLAIR )",
  "19_TextBox_1": "Click on Add Data in the Welcome to Slicer Module\n\nClick on Choose File(s) to Add and browse to the loccation of the Slicer datasets",
  "20_TextBox_0": "Select the module MONAIAuto3DSeg and enter the model's name Brain Tumor Segmentation in the Segmentation model menu",
  "20_TextBox_1": "Select the model Brain Tumor Segmentation (BRATS) GLI",
  "21_TextBox_0": "Enter the input volumes as follows:\n\nInput T2F volume: BraTS-GLI_00005-000-t12f\nInput T1C volume: BraTS-GLI_00005-00-t1c\nInput T1N volume: BraTS-GLI_00005-000-t1n\nInput T2W volume: BraTS-GLI_00005-000-t2w\n\n\nClick on Create new Segmentation on Appply\n\nClick on Apply to start the segmentation",
  "22_TextBox_1": "Slicer starts running the inference task\n\nOnce the segmentation is done, 'Processing finished' appears in the Slicer GUI",
  "23_TextBox_1": "Click on Show 3D to display the 3D segments in the 3D Viewer",
  "24_TextBox_0": "AI Segmentation Task #3: Whole Body Segmentation",
  "25_TextBox_1": "AI-based Segmentation of the whole body.\n\n\nDataset:\nCT_ThoraxAbdomen",
  "26_TextBox_0": "In the Add DICOM Data module, select the Patient patient1 and double click onthe image CT_Thorax_Abdomen to load it in Slicer",
  "27_TextBox_0": "Select the module MONAIAuto3DSeg and enter the model's name Whole Body Segmentation in the  Segmentation model menu",
  "27_TextBox_1": "Select the model Whole Body Segmentation TS1-quick",
  "28_TextBox_0": "Select the input Volume 6: CT_Thorax_Abdomen,\n\nClick on Create new Segmentation on Apply\n\nClick on Apply to start the segmentation",
  "29_TextBox_0": "Slicer displays the results of the IA-based segmentation using the Whole Body Segmentation TS1-quick",
  "30_TextBox_0": "Conclusion",
  "30_TextBox_1": "The 3D SlicerMONAIAuto3DSeg extension provides fast AI-based segmentation of anatomical and pathological structures.\n\n\nThe module can run on standard laptop and desktop computers with no GPU.",
  "31_TextBox_1": "The 3D Slicer internationalization project and the 3D Slicer for Latin America project have been made possible by two CZI Essential  Open Source Software for Science (EOSS cycle 4 & 5) grants.",
  "15_TextBox_0": "Slicer starts the inference",
  "31_TextBox_0": "Acknowledgements"
}